SrvrtsRefDOCMGRDEMO/src/InformationRegisters/СостояниеДокументовПоЭДО/СостояниеДокументовПоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеДокументовПоЭДО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеВерсииДокументаПоЭДО</name>
    <type>
      <types>EnumRef.СостоянияВерсийЭДДО</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеЭД</name>
    <type>
      <types>EnumRef.НаправленияЭД</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументДО</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SrvrtsRefDOCMGRDEMO/src/Catalogs/ВидыБизнесСобытий/ВидыБизнесСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыБизнесСобытий</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВозобновлениеБизнесПроцесса</name>
      <description>Возобновление процесса</description>
    </items>
    <items>
      <name>ВыполнениеЗадачи</name>
      <description>Выполнение задачи</description>
    </items>
    <items>
      <name>ДобавлениеВКатегорию</name>
      <description>Добавление в категорию</description>
    </items>
    <items>
      <name>ЗавершениеБизнесПроцесса</name>
      <description>Завершение процесса</description>
    </items>
    <items>
      <name>ЗахватФайлаДляРедактирования</name>
      <description>Захват файла для редактирования</description>
    </items>
    <items>
      <name>ИзменениеБрони</name>
      <description>Изменение брони</description>
    </items>
    <items>
      <name>ИзменениеВнутреннегоДокумента</name>
      <description>Изменение внутреннего документа</description>
    </items>
    <items>
      <name>ИзменениеВходящегоДокумента</name>
      <description>Изменение входящего документа</description>
    </items>
    <items>
      <name>ИзменениеЗначенияПоказателяПроцесса</name>
      <description>Изменение значения показателя процесса</description>
    </items>
    <items>
      <name>ИзменениеИсходящегоДокумента</name>
      <description>Изменение исходящего документа</description>
    </items>
    <items>
      <name>ИзменениеМероприятия</name>
      <description>Изменение мероприятия</description>
    </items>
    <items>
      <name>ИзменениеОтсутствия</name>
      <description>Изменение отсутствия</description>
    </items>
    <items>
      <name>ИзменениеПроекта</name>
      <description>Изменение проекта</description>
    </items>
    <items>
      <name>ИзменениеПроектнойЗадачи</name>
      <description>Изменение проектной задачи</description>
    </items>
    <items>
      <name>ИзменениеСоставаКомплекта</name>
      <description>Изменение состава комплекта</description>
    </items>
    <items>
      <name>ИзменениеСостоянияДокументаПоЭДО</name>
      <description>Изменение состояния документа по ЭДО</description>
    </items>
    <items>
      <name>ИзменениеФайла</name>
      <description>Изменение файла</description>
    </items>
    <items>
      <name>НазначениеОтветственного</name>
      <description>Назначение ответственным за документ</description>
    </items>
    <items>
      <name>ОсвобождениеФайла</name>
      <description>Освобождение файла</description>
    </items>
    <items>
      <name>ОстановкаБизнесПроцесса</name>
      <description>Остановка процесса</description>
    </items>
    <items>
      <name>ОтменаВыполненияЗадачи</name>
      <description>Отмена выполнения задачи</description>
    </items>
    <items>
      <name>ПеренаправлениеЗадачи</name>
      <description>Перенаправление задачи</description>
    </items>
    <items>
      <name>ПеререгистрацияВнутреннегоДокумента</name>
      <description>Перерегистрация внутреннего документа</description>
    </items>
    <items>
      <name>ПеререгистрацияВходящегоДокумента</name>
      <description>Перерегистрация входящего документа</description>
    </items>
    <items>
      <name>ПеререгистрацияИсходящегоДокумента</name>
      <description>Перерегистрация исходящего документа</description>
    </items>
    <items>
      <name>ПолучениеВходящегоПисьма</name>
      <description>Получение входящего письма</description>
    </items>
    <items>
      <name>ПрерываниеБизнесПроцесса</name>
      <description>Прерывание процесса</description>
    </items>
    <items>
      <name>РегистрацияВнутреннегоДокумента</name>
      <description>Регистрация внутреннего документа</description>
    </items>
    <items>
      <name>РегистрацияВходящегоДокумента</name>
      <description>Регистрация входящего документа</description>
    </items>
    <items>
      <name>РегистрацияИсходящегоДокумента</name>
      <description>Регистрация исходящего документа</description>
    </items>
    <items>
      <name>СозданиеБрони</name>
      <description>Создание брони</description>
    </items>
    <items>
      <name>СозданиеВнутреннегоДокумента</name>
      <description>Создание внутреннего документа</description>
    </items>
    <items>
      <name>СозданиеВходящегоДокумента</name>
      <description>Создание входящего документа</description>
    </items>
    <items>
      <name>СозданиеЗадачи</name>
      <description>Создание задачи</description>
    </items>
    <items>
      <name>СозданиеИсходящегоДокумента</name>
      <description>Создание исходящего документа</description>
    </items>
    <items>
      <name>СозданиеКонтрагента</name>
      <description>Создание контрагента</description>
    </items>
    <items>
      <name>СозданиеМероприятия</name>
      <description>Создание мероприятия</description>
    </items>
    <items>
      <name>СозданиеОтсутствия</name>
      <description>Создание отсутствия</description>
    </items>
    <items>
      <name>СозданиеПроекта</name>
      <description>Создание проекта</description>
    </items>
    <items>
      <name>СозданиеПроектнойЗадачи</name>
      <description>Создание проектной задачи</description>
    </items>
    <items>
      <name>СозданиеСообщения</name>
      <description>Создание сообщения</description>
    </items>
    <items>
      <name>СозданиеФайла</name>
      <description>Создание файла</description>
    </items>
    <items>
      <name>СтартБизнесПроцесса</name>
      <description>Старт процесса</description>
    </items>
    <items>
      <name>УдалениеИзКатегории</name>
      <description>Удаление из категории</description>
    </items>
    <items>
      <name>Удалить_ВыполнениеЗадачи</name>
      <description>Удалить Выполнение задачи</description>
    </items>
    <items>
      <name>Удалить_ИзменениеСоставаКомплекта</name>
      <description>Удалить Изменение состава комплекта</description>
    </items>
    <items>
      <name>УдалитьИзменениеСостоянияБрони</name>
      <description>Удалить изменение состояния брони</description>
    </items>
    <items>
      <name>Удалить_ОтменаВыполненияЗадачи</name>
      <description>Удалить Отмена выполнения задачи</description>
    </items>
    <items>
      <name>Удалить_ПеренаправлениеЗадачи</name>
      <description>Удалить Перенаправление задачи</description>
    </items>
    <items>
      <name>УдалитьПодошелСрокЗадачи</name>
      <description>Удалить Подошел срок задачи</description>
    </items>
    <items>
      <name>УдалитьПросроченаЗадача</name>
      <description>Удалить Просрочена задача</description>
    </items>
    <items>
      <name>Удалить_СозданиеЗадачи</name>
      <description>Удалить Создание задачи</description>
    </items>
    <items>
      <name>Удалить_СозданиеФайла</name>
      <description>Удалить Создание файла</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

SrvrtsRefDOCMGRDEMO/src/InformationRegisters/СостояниеДокументовПоЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр СостояниеДокументовПоЭДО.
//
// Параметры:
//  Документ - СправочникСсылка.ВнутренниеДокументы - Документ 1С:Документооборот.
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент, с которым ведется ЭДО.
//  Комментарий - Строка - Комментарий к состоянию.
//
Процедура Добавить(Документ, Контрагент, СостояниеВерсииДокументаПоЭДО, НаправлениеЭД = Неопределено, Комментарий = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостояниеДокументовПоЭДО");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ДокументДО", Документ);
		ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
		Блокировка.Заблокировать();
		
		Период = ТекущаяДатаСеанса();
		СостояниеДокумента = ПолучитьСостояниеДокумента(Документ, Период, Контрагент);
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Период;
		МенеджерЗаписи.ДокументДО = Документ;
		МенеджерЗаписи.Контрагент = Контрагент;
		МенеджерЗаписи.СостояниеВерсииДокументаПоЭДО = СостояниеВерсииДокументаПоЭДО;
		Если Не Комментарий = Неопределено Тогда
			МенеджерЗаписи.Комментарий = Комментарий;
		КонецЕсли;
		МенеджерЗаписи.НаправлениеЭД = ?(НаправлениеЭД <> Неопределено,
			НаправлениеЭД,
			СостояниеДокумента.Направление);
		МенеджерЗаписи.Записать();
		
		ЗарегистрироватьИзменениеСостоянияДокументаПоЭДО(
			МенеджерЗаписи.ДокументДО,
			МенеджерЗаписи.Контрагент,
			МенеджерЗаписи.НаправлениеЭД,
			СостояниеДокумента.Состояние,
			МенеджерЗаписи.СостояниеВерсииДокументаПоЭДО);
		
		Делопроизводство.ЗаписатьДанныеДокумента(Документ, "СостояниеЭДО", СостояниеВерсииДокументаПоЭДО);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Удаляет записи из регистра СостояниеДокументовПоЭДО.
//
// Параметры:
//  Документ - СправочникСсылка.ВнутренниеДокументы - Документ 1С:Документооборот.
//
Процедура Удалить(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостояниеДокументовПоЭДО");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ДокументДО", Документ);
		Блокировка.Заблокировать();
		
		СостояниеДокумента = ПолучитьСостояниеДокумента(Документ, Неопределено, Неопределено);
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументДО.Установить(Документ);
		НаборЗаписей.Записать();
		
		ЗарегистрироватьИзменениеСостоянияДокументаПоЭДО(
			Документ,
			СостояниеДокумента.Контрагент,
			СостояниеДокумента.Направление,
			СостояниеДокумента.Состояние,
			Перечисления.СостоянияВерсийЭДДО.ПустаяСсылка());
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает состояние документа в ЭДО.
//
// Параметры:
//  Документ   - СправочникСсылка.ВнутренниеДокументы, СправочникОбъект.ВнутренниеДокументы - 
//				 Документ 1С:Документооборот, для которого необходимо получить состояние.
//  Дата	   - Дата - Дата, на которую необходимо получить состояние.
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент, для которого необходимо получить состояние.
// 
// Возвращаемое значение:
//  Структура - 
//		* Дата - Дата - Дата установки состояния
//		* Состояние - ПеречислениеСсылка.СостоянияВерсийЭДДО - Состояние документа в ЭДО
//		* Направление - ПеречислениеСсылка.НаправленияЭД - Направление документа (входящий / исходящий)
//		* Комментарий - Строка - Комментарий
//
Функция ПолучитьСостояниеДокумента(Документ, Дата = Неопределено, Контрагент = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозвращаемоеЗначение = Новый Структура("Дата, Состояние, Направление, Комментарий, Контрагент",
		Дата(1, 1, 1),
		Перечисления.СостоянияВерсийЭДДО.ПустаяСсылка(),
		Перечисления.НаправленияЭД.ПустаяСсылка(),
		"",
		Справочники.Контрагенты.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	СостояниеДокументовПоЭДО.Период КАК Дата,
		|	СостояниеДокументовПоЭДО.СостояниеВерсииДокументаПоЭДО КАК Состояние,
		|	СостояниеДокументовПоЭДО.Контрагент КАК Контрагент,
		|	СостояниеДокументовПоЭДО.НаправлениеЭД КАК Направление,
		|	СостояниеДокументовПоЭДО.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СостояниеДокументовПоЭДО.СрезПоследних(
		|			&Дата,
		|			ДокументДО = &Документ
		|				%1) КАК СостояниеДокументовПоЭДО",
		?(ЗначениеЗаполнено(Контрагент), "И Контрагент = &Контрагент", ""));
	
	Запрос.УстановитьПараметр("Дата", ?(Не ЗначениеЗаполнено(Дата), ТекущаяДатаСеанса(), Дата));
	Запрос.УстановитьПараметр("Документ", ?(ОбщегоНазначения.ЗначениеСсылочногоТипа(Документ), Документ, Документ.Ссылка));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Выборка);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает состояние версии документа ДО по ЭДО.
//
// Параметры:
//  Документ - СправочникСсылка.ВнутренниеДокументы, СправочникОбъект.ВнутренниеДокументы - 
//			   Документ, для которого необходимо получить состояние.
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент по ЭДО.
// 
// Возвращаемое значение:
//  СостоянияВерсийЭДДО - ПеречислениеСсылка.СостоянияВерсийЭДДО - Cостояние версии документа ДО по ЭДО.
//
Функция ДанныеСостоянияДокументаПоЭДО(Документ, Контрагент = Неопределено, НаДату = Неопределено, НаправлениеЭД = Неопределено) Экспорт
	
	СостояниеДокумента = ПолучитьСостояниеДокумента(Документ, НаДату, Контрагент);	
	
	НаДату = СостояниеДокумента.Дата;
	НаправлениеЭД = СостояниеДокумента.Направление;
	
	Возврат СостояниеДокумента.Состояние;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Регистрирует бизнес-событие "Изменение состояния документа по ЭДО".
//
// Параметры:
//  Документ           - СправочникСсылка.ВнутренниеДокументы   - Документ 1С:Документооборот.
//  Контрагент         - СправочникСсылка.Контрагенты           - Контрагент, с которым ведется ЭДО.
//  НаправлениеЭД      - ПеречислениеСсылка.НаправленияЭД       - Направление электронного документа.
//  СтароеСостояниеЭДО - ПеречислениеСсылка.СостоянияВерсийЭДДО - Старое состояние ЭДО.
//  НовоеСостояниеЭДО  - ПеречислениеСсылка.СостоянияВерсийЭДДО - Новое состояние ЭДО.
//
Процедура ЗарегистрироватьИзменениеСостоянияДокументаПоЭДО(Документ, Контрагент, НаправлениеЭД, СтароеСостояниеЭДО, НовоеСостояниеЭДО)
	
	Если СтароеСостояниеЭДО = НовоеСостояниеЭДО Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИзмененияСостоянияЭДО = Новый Структура("Контрагент, НаправлениеЭД, СтароеСостояниеЭДО, НовоеСостояниеЭДО");
	ДанныеИзмененияСостоянияЭДО.Контрагент = Контрагент;
	ДанныеИзмененияСостоянияЭДО.НаправлениеЭД = НаправлениеЭД;
	ДанныеИзмененияСостоянияЭДО.СтароеСостояниеЭДО = СтароеСостояниеЭДО;
	ДанныеИзмененияСостоянияЭДО.НовоеСостояниеЭДО = НовоеСостояниеЭДО;
	
	БизнесСобытияВызовСервера.ЗарегистрироватьСобытие(
		Документ,
		Справочники.ВидыБизнесСобытий.ИзменениеСостоянияДокументаПоЭДО,
		Новый ХранилищеЗначения(ДанныеИзмененияСостоянияЭДО));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
